Revit 2027 API
DockablePaneId Class
 Identifier for a pane that participates in the Revit docking window system.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.UI.DockablePaneId
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockablePaneId : GuidEnum
Public Class DockablePaneId
	Inherits GuidEnum
public ref class DockablePaneId : public GuidEnum
type DockablePaneId =
    class
        inherit GuidEnum
    end
The DockablePaneId type exposes the following members.
Constructors
Name | Description
DockablePaneId | Creates a new DockablePaneId instance.
Top
Properties
Name | Description
Guid |  The Guid of GUID-based enum object.
(Inherited from GuidEnum)
Top
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Inherited from GuidEnum)
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Inherited from GuidEnum)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Operators
Name | Description
Equality(DockablePaneId, DockablePaneId) | Compares two DockablePaneId instances.
Inequality(DockablePaneId, DockablePaneId) | Compares two DockablePaneId instances.
Top
See Also
Reference
Autodesk.Revit.UI Namespace